import React from "react";


const IndiraGandhiVidhanaBhavanPage = () => {
  const handleMouseOver = (e) => {
    e.currentTarget.classList.add("hover-effect");
  };

  const handleMouseOut = (e) => {
    e.currentTarget.classList.remove("hover-effect");
  };

  const sections = [
    {
      title: "निर्माण और इतिहास",
      content: `1 नवम्‍बर, 1956 को मध्‍यप्रदेश बनने के बाद मध्‍यप्रदेश विधानसभा का अपने वर्तमान रूपमें पुनर्गठन हुआ. इस पुनर्गठन में विन्‍ध्‍यप्रदेश, मध्‍यभारत, महाकौशल और भोपाल राज्‍य की विधान सभाओं को शामिल किया गया। इन विधानसभाओं का एकीकरण होते ही इन चारों विधानसभाओं के सदस्‍य अपने आप मध्‍यप्रदेश की नयी और पहली विधानसभा के सदस्‍य बन गये।         राज्‍य के पुनर्गठन के कुछ पहले सितम्‍बर, 1956 में ही नयी एकीकृत विधानसभा के भवन के लिए भोपाल की एक खूबसूरत इमारत मिंटो हॉल का चुनाव कर लिया गया था। अंग्रेजी राज, नवाबी हुकूमत के दौर और बाद में लोकतंत्रीय शासन के साक्षी मिंटो हॉल की कहानी 12 नवम्‍बर, 1909 से शुरू होती है। तत्‍कालीन गवर्नर जनरल लॉर्ड मिंटो इस दिन अपनी पत्‍नी के साथ भोपाल आए। भोपाल की शासक नवाब सुल्‍तान जहां बेगम को यह कमी महसूस हुई कि लॉर्ड मिंटो को ठहराने के लिए भोपाल में कोई अच्‍छा भवन नहीं था। उन्‍होंने तुरत-फुरत एक नायाब इमारत बनवाने का फैसला किया। इसी दिन उन्‍होंने लार्ड मिंटों के हाथों इस भवन का शिलान्‍यास करवाया था। अंग्रेज इंजीनियर ए.सी. रबेन की देखरेख में इस भवन का निर्माण कार्य प्रारंभ हुआ। इस भवन की लागत आई 3 लाख रूपये, लेकिन इसको बनने में बहुत लंबा वक्‍त लगा करीब 24 साल। इस नई इमारत का नाम मिंटो हॉल रखा गया। अतिथि गृह के रूप में मिंटो हॉल का इस्‍तेमाल बहुत कम ही हो पाया। इस भव्‍य भवन का उपयोग भोपाल राज्‍य की सेना के मुख्‍यालय, आर्थिक सलाहकार के दफ्तर, पुलिस मुख्‍यालय और होटल के रूप में हुआ।
                    इस इमारत के भव्‍य हॉल में स्‍केटिंग रिंग के रूप में नवाबी घरानों के लड़के-लड़कियॉं स्‍केटिंग सीखते रहे। सन् 1946 में इसमें इंटर कॉलेज की स्‍थापना हुई जो कि बाद में हमीदिया कॉलेज के रूप में जाना गया। हमीदिया कॉलेज इस इमारत में 1956 तक लगता रहा।
                    1 नवम्‍बर, 1956 से यह भवन विधानसभा भवन के रूप में परिवर्तित हुआ। तब से लेकर अगस्‍त, 1996 तक यह भवन मध्‍यप्रदेश की चालीस वर्ष की संसदीय यात्रा का हमकदम और मध्‍यप्रदेश के लोकतांत्रिक इतिहास का साक्षी बना रहा।
                    विधानसभा के कामकाज की बढ़ती जरूरतों के मद्देनजर मूल मिंटो हॉल में इमारतों के नये खंड जोड़ना पडे। सन् 1980 तक यह महसूस किया जाने लगा था कि विधानसभा से जुडे कामकाज के फैलाव को देखते हुए विधानसभा के लिए एक ऐसी इमारत की जरूरत है, जिसमें सभी सहूलियतें तथा पर्याप्‍त जगह हो। 14 मार्च, 1981 को तत्‍कालीन लोक सभा अध्‍यक्ष श्री बलराम जाखड़ द्वारा नये विधानसभा भवन का शिलान्‍यास संपन्‍न हुआ। अरेरा पहाड़ी पर बिड़ला मंदिर और राज्‍य मंत्रालय के बीच 17 सितम्‍बर, 1984 को इस नये भवन का निर्माण प्रारंभ हुआ।
                    इसके निर्माण में कई तरह की रूकावटें आती रहीं और निर्माण का काम धीमी गति से चलता रहा। वर्ष 1994 के अंत में तत्‍कालीन सरकार ने इस काम में तेजी लाने के लिए एक साधिकार समिति का गठन किया और उसे यह काम 18 महीने में पूरा करने की जिम्‍मेदारी सौंपी। साधिकार समिति ने निर्माण में आ रही सभी रूकावटों को दूर किया, सभी आवश्‍यक साधन जुटाये और समय-सीमा के भीतर नये भवन का निर्माण पूरा कर दिखाया। भवन की प्रारम्भिक लागत 10 करोड़ रूपये अनुमानित थी, लेकिन 12 वषों में बनते-बनते इसमें आंतरिक साजसज्‍जा, फर्नीचर, आधुनिक साउंड सिस्‍टम, वातानुकूलन, आधुनिक कैफेटेरिया एवं बगीचों का निर्माण व अन्‍य सुविधाओं को शामिल करने से इसकी लागत लगभग 54 करोड़ रूपये हो गई है।`,
      image: "/galleries/oldvidhansabha.jpg",
      alt: "मिंटो हॉल",
      extraHeading: "(मिंटो हॉल का ऐतिहासिक भवन)",
    },
    {
      title: "नया विधानसभा भवन",
      content: `  इस नए भवन का उद्घाटन दिनांक 3 अगस्‍त, 1996 को तत्‍कालीन राष्‍ट्रपति डॉ. शंकरदयाल शर्मा के कर कमलों से हुआ। भवन का नाम ''इंदिरा गांधी विधान भवन'' रखा गया है।  इस भवन का डिजायन विख्‍यात वास्‍तुविद् चार्ल्‍स कोरिया ने तैयार किया है। पूरा भवन वृत्‍ताकार है, जिसका व्‍यास 140 मीटर है। समुद्रतल से इसकी ऊंचाई 573.25 मीटर है। इसमें केन्‍द्रीय वातानुकूलन की व्‍यवस्‍था हैा भवन को 6 सेक्‍टरों में बांटा गया है। भवन में विधानसभा के साथ-साथ विधान परिषद् के लिए हॉल बनाया गया है। यह सेक्‍टर एक में स्थित है, जिसमें लगभग 90 सदस्‍यों के बैठने की व्‍यवस्‍था है। इसमें अधिकारी दीर्घा, पत्रकार दीर्घा व दर्शक दीर्घाओं का प्रावधान है। परिषद् का आकार वर्गाकार है। हाल की ऊंचाई 20 मीटर है। इसकी छत स्‍पेस ट्रस की है। इसमें प्राकृतिक रोशनी आने की व्‍यवस्‍था है। इसका फर्नीचर सडार वुड का है। मध्‍यप्रदेश में द्वितीय सदन की संवैधानिक व्‍यवस्‍था नहीं होने के कारण वर्तमान में इस हॉल का उपयोग सेमीनार एवं प्रशिक्षण हेतु किया जा रहा है। इसके प्रवेश द्वार पर ''जीवन वृक्ष'' नामक एक विशाल पेंटिंग है, जिसमें प्रदेश के ऐतिहासिक स्‍थलों को दर्शाया गया है। सेक्‍टर एक में ही समिति कक्ष-2 (अजन्‍ता), दलीय कार्यालय व माननीय नेता प्रतिपक्ष के कक्ष हैं व द्वितीय तल पर सचिवालय की शाखायें लगती हैं।`,
      image: "/galleries/newgvidhansabha.jpg",
      alt: "इंदिरा गांधी विधान भवन",
      extraHeading: "(नया भवन उद्घाटन)",
    },
    {
      title: "वास्तुकला और विशेषताएँ",
      content: `  विधान परिषद् के ठीक सामने विधानसभा हाल सेक्‍टर दो में स्थित है। इसका मुख्‍य प्रवेश द्वार सांची द्वारा की तरह है। इस पर कोलाज का कार्य किया गया है। सभागृह की छत पर आकार गुंबद का है। गुंबद का व्‍यास 31 मीटर, ऊँचाई लगभग 26 मीटर है। गुंबद में प्राकृतिक रोशनी आने की व्‍यवस्‍था है। इसमें अधिकारी दीर्घा एवं अध्‍यक्षीय दीर्घा भूतल पर है। सदन से लगी हुई माननीय सदस्‍यों के लिए एक खूबसूरत लॉबी है, जिसमें से पॉंच प्रवेश द्वारा सदन में जाने के लिए हैं। एक छोटा सा केफेटेरिया भी है। ऊपर की मंजिल में आठ दीर्घाएं हैं। इनमें दो पत्रकारों के लिए, दो सामान्‍य, एक राज्‍यपाल महोदय, एक अध्‍यक्षीय दीर्घा, एक महिला दीर्घा, एक प्रतिष्ठित दर्शक दीर्घा है। सभी दीर्घाओं में प्राकृतिक रोशनी आने की व्‍यवस्‍था है। सभावेश्‍म में आधुनिक श्रवण एवं इलेक्‍ट्रानिक मतदान प्रणाली लगी है। सभा के हॉल में 366 सदस्‍यों के बैठने की व्‍यवस्‍था थी। छत्‍तीसगढ़ राज्‍य के गठन के बाद वर्तमान में 250 सदस्‍यों के बैठने की व्‍यवस्‍था है। वर्तमान सदस्‍य संख्‍या 230 एवं एक नामजद सदस्‍य सहित कुल 231 सदस्‍य सदन में बैठते हैं। सभा हॉल के समीप माननीय अध्‍यक्ष महोदय, माननीय उपाध्‍यक्ष महोदय व प्रमुख सचिव विधानसभा के कक्ष हैं। इमारत के मध्‍य में सेक्‍टर चार में दस हजार वर्गफीट क्षेत्रफल का, 11 मीटर ऊॅंचा एक विशाल केन्‍द्रीय कक्ष है। इसकी छत चार स्‍तम्‍भों पर टिकी है। यह भवन का केन्‍द्र बिन्‍दु है और यह केन्‍द्रीय कक्ष भवन को चारों दिशाओं से जोड़ता है। इसमें प्राकृतिक रोशनी आने की उत्‍त्‍म व्‍यवस्‍था है। केन्‍द्रीय कक्ष से लगा हुआ बैंक, पोस्‍ट आफिस, रेल्‍वे आरक्षण, होम्‍योपैथी तथा आयुर्वेदिक चिकित्‍सालय हैं। एलोपैथिक चिकित्‍सालय मुख्‍य भवन के बाहर स्थित है।
                    सेक्‍टर पांच में विधानसभा का वृहद पुस्‍तकालय है, जिसमें लगभग 1 लाख 75 हजार पुस्‍तकें तथा विभिन्‍न साहित्‍य संग्रहित हैं। पुस्‍तकालय के गांधी नेहरू कक्ष में महात्‍मा गांधी तथा पंडित जवाहरलाल नेहरू की लिखी तथा इन पर लिखी गई विभिन्‍न लेखकों की पुस्‍तकें तथा साहित्‍य संग्रहित हैं। पुस्‍तकालय को चार भागों में बांटा गया है, प्रथम दो भाग पुस्‍तकों के लिए हैं। महत्‍वपूर्ण पुस्‍तकों को रखने के लिए काम्‍पेक्‍टर्स की व्‍यवस्‍था है। प्रथम तल पर माननीय सदस्‍यों के लिए वाचन कक्ष की व्‍यवस्‍था है।`,
      image: "/galleries/pillarsvidhansabha.jpg",
      alt: "भवन की वास्तुकला",
      extraHeading: "(भवन का आधुनिक और पारंपरिक समन्वय)",
    },
    {
      title: "सभागार",
      content: `  नये भवन के सेक्‍टर छ: में एक सभागार भी है, जिसमें 600 लोग बैठ सकते हैं। इसकी छत सिविल इंजीनियरिंग की बेजोड कारीगरी है। इसकी छत की कुल मोटाई 25 से.मी. है। इसमें बीम नहीं है। इसकी छत के उच्‍चतम व न्‍यूनतम बिन्‍दु में 6 मीटर का लेवल अंतर है। इसमें आधुनिक साउण्‍ड सिस्‍टम लगा हुआ है। व्‍ही.आई.पी. आगन्‍तुकों के लिए अलग से प्रवेश द्वार है।`,
      image: "/galleries/auditoriumvidhansabha.jpg",
      alt: "भवन का सेक्टर",
      extraHeading: "(भवन के विभिन्न सेक्टर और सुविधा क्षेत्र)",
    },
    {
      title: "राष्ट्रीय प्रतीक(NationalEmblem)",
      content: `भवन में मंत्रियों के 57 कक्ष, 7 बड़े व 7 छोटे समिति कक्ष, 300 कमरे, पुस्तकालय, सभा हॉल, और विभिन्न दीर्घाएं स्थित हैं। 
      भवन के बाहर 25 एकड़ में वृक्ष और आम का बगीचा है। 
      स्वतंत्रता दिवस और गणतंत्र दिवस पर भवन में विद्युत सज्जा की जाती है, जिससे इसकी भव्यता और बढ़ जाती है।  भवन में मंत्रियों के 57 कक्ष, 7 बड़े व 7 छोटे समिति कक्ष हैं। भवन में 300 कक्ष हैं व इनमें 350 दरवाजे और 1000 खिड़कियां हैं। भवन में 60 प्रसाधन कक्ष हैं। भवन के निर्माण में 26 लाख ईंट, 2 लाख 6 हजार बोरी सीमेंट और 1 हजार 650 टन लोहे का प्रयोग हुआ है। भवन के पश्चिमी द्वार पर केफेटेरिया स्थित है। इसमें आधुनिक किचन मशीन लगाये गये हैं। इससे व इसकी छत से भोपाल का विहंगम दृश्‍य बहुत ही मनोहारी दिखाई देता है। भोपाल के दोनों प्रसिद्ध ताल यहां से एक साथ दिखाई देते हैं।
                    भवन के रूपाकार को दिशा देने वाली महत्‍वपूर्ण बातें हैं, अरेरा पहाड़ी के शीर्ष पर इसका स्‍थान जिसके न्‍यूनतम एवं उच्‍चतम लेवल में 11 मीटर का अंतर है, जिसे इस कुशलता के साथ समायोजित किया गया है, कि भवन के अंदर भ्रमण करने के बाद भी इसका अहसास नहीं होता,  भोपाल की मस्जिदें और भोपाल के निकट सांची का स्‍तूप। इन कारणों के अतिरिक्‍त सबसे महत्‍वपूर्ण कारक जिसने इसे आकार दिया वह था ''मंडल''। यह भारतीय मानस की वह ब्रम्‍हांडीय अवधारणा है, जिसमें क्रिया, कार्य और अंतरिक्ष समाहित है।
                    भवन अपने संयोजन में स्‍थान के भीतर स्‍थान संजोये आकाश की तरह है। मंडल की ही तरह इसके नौ घटक हैं। ये सभी एक केन्‍द्र के इर्द-गिर्द रचे गए हैं। केन्‍द्र से निकलने वाली दो धुरियों पर प्रशासनिक कार्यालय हैं और चारों कोनों पर विधान परिषद्, विधान सभा, सभागार और ग्रंथागार स्थित हैं। इस भवन की वास्‍तुकला भारतीय संस्‍कृति की परंपराओं एवं आधुनिक तकनीक का सुंदर समन्‍वय है। इस भवन में प्रवेश हेतु सात द्वार हैं। भवन के मुख्‍य प्रवेश द्वार पर कुंड की संरचना निर्मित है, जो विधानसभा में होने वाले लोकतंत्र के यज्ञ को आभासित करता है। कुंड के पास की भित्तियों पर लोक कलाकारों द्वारा सुंदर चित्र बनाए गए हैं। इसी के पास प्रदेश का एक जलीय नक्‍शा निर्मित किया गया है, जिसमें 36 फीट लम्‍बी एवं 6 फीट ऊँची तथा 36 टन वजनी ग्रेनाइट में बनी मूर्ति स्‍थापित है। भवन में जगह-जगह पर ख्‍यातिनाम चित्रकारों की पेंटिंग्‍स एवं पत्‍थर शिल्‍प रखे गए हैं, जो भवन की सुन्‍दरता बढ़ाने में सहायक हैं। भवन को वास्‍तुकला के क्षेत्र में विश्‍व प्रसिद्ध आगा खां अवार्ड भी मिल चुका है।
                    भवन के बाहर 25 एकड़ में विभिन्‍न प्रजाति के वृक्षों के अतिरिक्‍त आम का बगीचा है।
                    स्‍वाधीनता दिवस, गणतंत्र दिवस और अन्‍य महत्‍वपूर्ण अवसरों पर जब इस भवन में विद्युत सज्‍जा की जाती है, तो रात्रि में इसकी भव्‍यता देखते ही बनती है। रौशनी की मनोहारी छटा देखने के लिए लोग उमड पडते हैं। साधारण दिनों में भी विधान सभा को देखने के लिए विशिष्‍ट और सामान्‍यजनों का आगमन होता रहता है। भोपाल आने वाले पर्यटक भी इस भवन को देखने का लोभ संवरण नहीं कर पाते।`,
      image: "/galleries/ashokastumbh.jpg",
      alt: "भवन का सेक्टर",
      extraHeading: "(भवन के विभिन्न सेक्टर और सुविधा क्षेत्र)",
    },
    
  ];

  return (
    <div className="wrapper">
      <h1 className="heading">इंदिरा गांधी विधान भवन</h1>

      {sections.map(({ title, content, image, alt, extraHeading }, index) => (
        <div key={index} className="section">
          <h2 className="subheading">{title}</h2>
          <p className="content">{content}</p>
          {image && (
            <img
              src={image}
              alt={alt}
              className="image"
              onMouseOver={handleMouseOver}
              onMouseOut={handleMouseOut}
            />
          )}
          {extraHeading && <div className="extra-heading">{extraHeading}</div>}
        </div>
      ))}
    </div>
  );
};

export default IndiraGandhiVidhanaBhavanPage;
